import random
import datetime 
import calendar 

Dayone=['วันจันทร์','วันอังคาร','วันพุธ','วันพฤหัส','วันศุกร์','วันเสาร์','วันอาทิตย์']
mounthone=['','มกราคม','กุมภาพันธ์','มีนาคม','เมษายน','พฤษภาคม','มิถุนายน','กรกฎาคม','สิงหาคม','กันยายน','ตุลาคม','พฤศจิกายน','ธันวาคม']
def fortuneLove():
   Love=["จะพบคนที่เข้ามาชอบยุ่งเรื่องของเจ้าของดวง",
     "คนที่เข้ามาหาคุณจะมีไฝที่เเก้มตูดด้านขวาทำมุมตั้งฉากกับตูด 32 องศา", 
     "จะได้รับความไม่ชัดเจนของอีกฝ่าย ฉะนั้นต้องใช้เเว่น optopus ใส่เเล้วสบายตามองเห็นชัดเจนเล่นเกมชัดเเจ๋ว",
     "พบรักกับคนที่มีเสนียดมากๆ",
     "ระยะทางยังเป็นอุปสรรคต่อกันด้านการสร้างความสัมพันธ์ เเต่ก็ปลอดภัยต่อโควิด-19นะจ้ะ",
     "ยังไม่เปิดใจให้ใครในช่วงนี้ เพราะไม่มีกุญเเจ",
     "คนที่เข้ามาดูให้ดีๆจะมีคนนิสัยรวยๆเข้ามาหา อย่าพลาดเชียว"
     ]
   print("ความรัก :"+random.choice(Love))
   return random.choice(Love)

def fortuneWork():
   Work=["พยายามปรับเปลี่ยนวิธีการดำเนินธุรกิจให้สอดคล้องกับสถานการณ์ปัจจุบัน เช่น กักตุนหน้ากากอนามัย",
        "ต้องเดินทางติดต่องานแล้วจะประสบความสำเร็จในการเดินทางงานไม่เกี่ยว",
        "หากเริ่มมีการโฆษณาสื่อประชาสัมพันธ์ที่ดีจะเริ่มธุรกิจการค้าได้อย่างไม่ยากนัก เช่น  เเกงเขียวหวาน 250 บาท",
        "ทำธุรกิจใดๆ ต้องดูเอกสารสัญญาให้ดีไม่เช่นนั้นจะโดนเอาเปรียบได้ อย่าโง่ค่ะ",
        "ด้วยวาทศิลป์ในการด่าที่ดีในการติดต่อเจรจาจะได้รับผลประโยชน์ที่ดี",
        "พยายามหาลู่ทาง ช่องทางใหม่ๆ ในการทำธุรกิจ จะได้ไม่เหนื่อย พยายามวิ่งลู่ในๆไว้",
        "มีที่ปรึกษาที่ดีเป็นคนสนิทจะทำให้เกิดความสำเร็จทางด้านการงานถ้าคุณโชคดีอาจจะได้คู่ครองเเถมด้วยนะจ้ะ"]
   print("การงาน :"+random.choice(Work))
   return random.choice(Work)

def fortuneMoney():
   Money=["ใช้จ่ายเท่าที่จำเป็นเท่านั้นจึงจะเหมาะกับสถานการณ์ เเต่จำเป็นทุกสถาณการณ์",
        "รายจ่ายมีมากเป็นพิเศษไม่สามารถหลีกเลี่ยงรายจ่ายใดๆ ได้เพราะติดปูผัดผงกะหรี่",
        "ต้องจ่ายเงินเป็นจำนวนมากออกไปในช่วงนี้ เพราะติดพนัน",
        "บริหารจัดการด้านการเงินให้ผ่านพ้นไปได้เป็นอย่างดี(ให้เมียเก็บ)",
        "มีภาระการใช้จ่ายในการช่วยเหลือบริวาร(สัตว์เลี้ยง)",
        "ได้เงินเพิ่มเข้ามาอย่างเป็นโชคดี(ถูกหวย) ",
        "ใช้ความประหยัดเอาไว้ก่อนจะดีที่สุดในช่วงนี้ กินมาม่าไปก่อน"]
   print("การเงิน :"+random.choice(Money))
   return random.choice(Money)

def fortuneColor():
   Color=["เเดง","ส้ม","เหลือง","ม่วง","น้ำเงิน","เขียว","ขาว","ดำ","น้ำตาล"]
   colornum=random.randint(0,8)
   print("สีนำโชค :"+Color[colornum])
   return Color[colornum]
def findDay(date): 
   born=datetime.datetime.strptime(date, '%Y-%m-%d').weekday()
   return Dayone[born]
def cutm(date):
   mounth=date.split('-')[1]
   return mounth
def cutd(date):
    day=date.split('-')[2]
    return day
def checkd(dateNo):
    if dateNo[0] == '0' : dateNo=dateNo[1]
    return dateNo

def checkm(mounthNo):
    if mounthNo[0] == '0' : mounthNo=mounthNo[1]
    return mounthNo

def getm(xNo):
    num=xNo
    return mounthone[num]